In [2]:
# A two-dimensional data structures with columns of potentially different types of dataframe.
import pandas as pd
import numpy as np

In [4]:
dict1 = {
    "name":['harry','rohan','dipesh','nikhil'],
    "marks":[20,30,50,35],
    "city":['rampur','tokyo','delhi','kathmandu']
}

In [8]:
df=pd.DataFrame(dict1)

In [9]:
df

     name  marks       city
0   harry     20     rampur
1   rohan     30      tokyo
2  dipesh     50      delhi
3  nikhil     35  kathmandu

In [11]:
df.to_csv('friends.csv')

In [12]:
df.to_csv('friends_index_false.csv',index=False)